In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
dframe = DataFrame({'city': ['Alma', 'Brian Head', 'Fox Park'],
                                       'altitude':[3158, 3000, 2752]})
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2752

In [4]:
state_map = {'Alma': 'Colorado', 'Brian Head':'Utah', 'Fox Park': 'Wyoming'}

In [5]:
dframe['state'] = dframe['city'].map(state_map)

In [6]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2752   Wyoming

In [7]:
dframe['kye1']=[0,1,2]

In [8]:
dframe

         city  altitude     state  kye1
0        Alma      3158  Colorado     0
1  Brian Head      3000      Utah     1
2    Fox Park      2752   Wyoming     2